In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1 = pd.DataFrame([[2,3,4,5], [7,8,9,20], [22,33,44,55],[12,13,14,15],[40,50,60,70]], columns=["a", "b", "c", "d"])

In [6]:
df1

    a   b   c   d
0   2   3   4   5
1   7   8   9  20
2  22  33  44  55
3  12  13  14  15
4  40  50  60  70

In [7]:
df1.head(4)

    a   b   c   d
0   2   3   4   5
1   7   8   9  20
2  22  33  44  55
3  12  13  14  15

In [8]:
df1.tail(2)

    a   b   c   d
3  12  13  14  15
4  40  50  60  70

In [9]:
df1

    a   b   c   d
0   2   3   4   5
1   7   8   9  20
2  22  33  44  55
3  12  13  14  15
4  40  50  60  70

In [10]:
df1.shape

(5, 4)

In [11]:
df1.iloc[0,2]

4

In [12]:
df1.iloc[2:4,1:3]

    b   c
2  33  44
3  13  14

In [15]:
df1.iat[0,0]

2

In [ ]:
df1.index